In [1]:
print('Hello world')

Hello world

In [5]:
 x = 5
for i in range (0, 5):
        print (x + i)

5
6
7
8
9

In [7]:
import pandas as pd

In [54]:
Cost_Data = pd.read_csv('../Cost_and_fees.csv', skiprows=4, nrows = 201)
Cost_Data

,1,2,3,4,5,6,7,8,9,10,...,16,17,18,19,20,21,22,23,24,25
0,All institutions,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1963-64,"$10,248","$10,561","$6,368","$4,174","$4,538","$1,406","$2,319","$2,288","$1,717",...,$775,$508,$553,$171,$282,$279,$209,$457,$455,$395
2,1968-69,"10,357","10,973","7,477","4,234","4,852","1,778","2,558","2,557","2,321",...,"1,053",596,683,250,360,360,327,502,502,476
3,1969-70,"10,460","11,227","7,304","4,325","5,062","1,659","2,610","2,627","2,326",...,"1,089",645,755,247,389,392,347,526,528,495
4,1970-71,"10,537","11,376","7,143","4,387","5,188","1,590","2,670","2,690","2,355",...,"1,120",688,814,249,419,422,369,546,549,501
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
196,2014-15,"25,011","24,908","27,426","14,951","14,901","15,255","6,202","6,204","6,185",...,"25,629","13,972","13,924","14,256","5,796","5,798","5,780","3,605","3,554","5,594"
197,2015-16,"25,273","25,215","25,840","15,086","15,041","15,388","6,217","6,209","6,301",...,"24,310","14,193","14,150","14,477","5,849","5,842","5,928","3,735","3,731","3,905"
198,2016-17,"26,543","26,648","26,121","15,050","15,053","15,028","7,190","7,302","6,563",...,"25,027","14,419","14,423","14,399","6,889","6,996","6,288","4,123","4,113","4,340"
199,2017-18,"26,797","26,951","25,584","14,973","14,982","14,908","7,418","7,565","6,229",...,"25,065","14,669","14,677","14,606","7,268","7,411","6,102","4,317","4,315","4,357"
200,2018-19,"27,040","26,575","30,052","14,780","14,715","15,360","7,118","7,410","5,305",...,"30,052","14,780","14,715","15,360","7,118","7,410","5,305","5,143","4,450","9,387"

In [14]:
data.drop(0)

,1,2,3,4,5,6,7,8,9,10,...,16,17,18,19,20,21,22,23,24,25
1,1963-64,"$10,248","$10,561","$6,368","$4,174","$4,538","$1,406","$2,319","$2,288","$1,717",...,$775,$508,$553,$171,$282,$279,$209,$457,$455,$395
2,1968-69,"10,357","10,973","7,477","4,234","4,852","1,778","2,558","2,557","2,321",...,"1,053",596,683,250,360,360,327,502,502,476
3,1969-70,"10,460","11,227","7,304","4,325","5,062","1,659","2,610","2,627","2,326",...,"1,089",645,755,247,389,392,347,526,528,495
4,1970-71,"10,537","11,376","7,143","4,387","5,188","1,590","2,670","2,690","2,355",...,"1,120",688,814,249,419,422,369,546,549,501
5,1971-72,"10,651","11,556","7,212","4,455","5,326","1,544","2,738","2,760","2,406",...,"1,172",724,865,251,445,448,391,562,564,530
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
196,2014-15,"25,011","24,908","27,426","14,951","14,901","15,255","6,202","6,204","6,185",...,"25,629","13,972","13,924","14,256","5,796","5,798","5,780","3,605","3,554","5,594"
197,2015-16,"25,273","25,215","25,840","15,086","15,041","15,388","6,217","6,209","6,301",...,"24,310","14,193","14,150","14,477","5,849","5,842","5,928","3,735","3,731","3,905"
198,2016-17,"26,543","26,648","26,121","15,050","15,053","15,028","7,190","7,302","6,563",...,"25,027","14,419","14,423","14,399","6,889","6,996","6,288","4,123","4,113","4,340"
199,2017-18,"26,797","26,951","25,584","14,973","14,982","14,908","7,418","7,565","6,229",...,"25,065","14,669","14,677","14,606","7,268","7,411","6,102","4,317","4,315","4,357"
200,2018-19,"27,040","26,575","30,052","14,780","14,715","15,360","7,118","7,410","5,305",...,"30,052","14,780","14,715","15,360","7,118","7,410","5,305","5,143","4,450","9,387"

In [15]:
data.columns

Index(['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13',
       '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25'],
      dtype='object')

In [17]:
column_names = ['1', '2', '3']
data[column_names].head(10)

                  1        2        3
0  All institutions      NaN      NaN
1          1963-64   $10,248  $10,561
2          1968-69    10,357   10,973
3          1969-70    10,460   11,227
4          1970-71    10,537   11,376
5          1971-72    10,651   11,556
6          1972-73    10,853   12,015
7          1973-74    10,337   11,392
8          1974-75     9,698   10,693
9          1975-76     9,605   10,754

In [18]:
data.loc[1]

1     1963-64
2      $10,248
3      $10,561
4       $6,368
5       $4,174
6       $4,538
7       $1,406
8       $2,319
9       $2,288
10      $1,717
11      $3,756
12      $3,736
13      $3,244
14      $1,248
15      $1,286
16        $775
17        $508
18        $553
19        $171
20        $282
21        $279
22        $209
23        $457
24        $455
25        $395
Name: 1, dtype: object

In [19]:
data.loc[1][3]

'$6,368'

In [25]:
def cast_to_numeric(string):
    if type(string) == float:
        return string
    else:
        string = string.replace('$', '')
        string = string.replace(',', '')
        number = float(string)
        return number

In [26]:
cast_to_numeric('$1000,20000')

100020000.0

In [28]:
data['2'] = data['2'].apply(cast_to_numeric)

In [29]:
data['2'].mean()

20803.918367346938

In [30]:
data['2'].sum()

4077568.0

In [31]:
data['2'].min()

6939.0

In [32]:
columns_to_change = ['2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13',
       '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25']

for column in columns_to_change:
    data[column] = data[column].apply(cast_to_numeric)

## General Plan

In [127]:
Bach_Salary = pd.read_csv('../Data/Bachelors_Weekly_Salary.csv', skiprows = 17)

In [128]:
Cost_Data = pd.read_csv('../Data/Cost_and_fees.csv', skiprows=57, nrows = 148)

In [142]:
Assoc_Salary = pd.read_csv('../Data/Associate_degree_money_made.csv', skiprows=19)
Assoc_Salary

    Year  Qtr1  Qtr2   Qtr3   Qtr4  Unnamed: 5
0   2011   521   516  511.0  529.0         NaN
1   2012   533   528  521.0  525.0         NaN
2   2013   521   527  531.0  531.0         NaN
3   2014   526   536  533.0  531.0         NaN
4   2015   527   535  543.0  545.0         NaN
5   2016   568   555  555.0  569.0         NaN
6   2017   581   581  580.0  579.0         NaN
7   2018   592   588  596.0  606.0         NaN
8   2019   603   612  619.0  619.0         NaN
9   2020   622   660  663.0  650.0         NaN
10  2021   649   661    NaN    NaN         NaN

In [143]:
Assoc_Salary.columns

Index(['Year', 'Qtr1', 'Qtr2', 'Qtr3', 'Qtr4', 'Unnamed: 5'], dtype='object')

In [155]:
Assoc_Column_Names = ['Qtr1', 'Qtr2', 'Qtr3', 'Qtr4']
Assoc_Salary[Assoc_Column_Names].head(10)

   Qtr1  Qtr2   Qtr3   Qtr4
0   521   516  511.0  529.0
1   533   528  521.0  525.0
2   521   527  531.0  531.0
3   526   536  533.0  531.0
4   527   535  543.0  545.0
5   568   555  555.0  569.0
6   581   581  580.0  579.0
7   592   588  596.0  606.0
8   603   612  619.0  619.0
9   622   660  663.0  650.0

In [157]:
Assoc_Salary = Assoc_Salary[Assoc_Column_Names]
Assoc_Salary

    Qtr1  Qtr2   Qtr3   Qtr4
0    521   516  511.0  529.0
1    533   528  521.0  525.0
2    521   527  531.0  531.0
3    526   536  533.0  531.0
4    527   535  543.0  545.0
5    568   555  555.0  569.0
6    581   581  580.0  579.0
7    592   588  596.0  606.0
8    603   612  619.0  619.0
9    622   660  663.0  650.0
10   649   661    NaN    NaN

In [159]:
all_data = Assoc_Salary
subset_data = all_data[some_columns]

NameError: name 'some_columns' is not defined

In [162]:
Assoc_Salary.dropna()

   Qtr1  Qtr2   Qtr3   Qtr4
0   521   516  511.0  529.0
1   533   528  521.0  525.0
2   521   527  531.0  531.0
3   526   536  533.0  531.0
4   527   535  543.0  545.0
5   568   555  555.0  569.0
6   581   581  580.0  579.0
7   592   588  596.0  606.0
8   603   612  619.0  619.0
9   622   660  663.0  650.0

In [163]:
Assoc_Salary.sum()

Qtr1    6243.0
Qtr2    6299.0
Qtr3    5652.0
Qtr4    5684.0
dtype: float64

In [164]:
Assoc_Salary.groupby(by = 'Qtr1')

In [174]:
row1 = Assoc_Salary.iloc[1:4]
row1

   Qtr1  Qtr2   Qtr3   Qtr4
1   533   528  521.0  525.0
2   521   527  531.0  531.0
3   526   536  533.0  531.0

In [175]:
practice_rows = Assoc_Salary.head(1)

In [182]:
import matplotlib.pyplot as plot

ModuleNotFoundError: No module named 'matplotlib'

In [187]:
import matplotlib.pyplot as plot

df = Assoc_Salary = pd.read_csv('../Data/Associate_degree_money_made.csv', skiprows=19, parse_dates = ['Year'])

df.plot.scatter(x = 'Year', y = 'Qtr 1')

ImportError: matplotlib is required for plotting when the default backend "matplotlib" is selected.

df['Yearly Salary'] = (('Qtr1' + 'Qtr2' + ' Qtr3' + 'Qtr4') / 4 * 52)